espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lcd_cam_reg.h
/** LCDCAM_LCD_CTRL_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_CTRL_REG (DR_REG_LCDCAM_BASE + 0x1c)
/** LCDCAM_LCD_HB_FRONT : R/W; bitpos: [10:0]; default: 0;
 *  It is the horizontal blank front porch of a frame.
 */
#define LCDCAM_LCD_HB_FRONT    0x000007FFU
#define LCDCAM_LCD_HB_FRONT_M  (LCDCAM_LCD_HB_FRONT_V << LCDCAM_LCD_HB_FRONT_S)
#define LCDCAM_LCD_HB_FRONT_V  0x000007FFU
#define LCDCAM_LCD_HB_FRONT_S  0
/** LCDCAM_LCD_VA_HEIGHT : R/W; bitpos: [20:11]; default: 0;
 *  It is the vertical active height of a frame.
 */
#define LCDCAM_LCD_VA_HEIGHT    0x000003FFU
#define LCDCAM_LCD_VA_HEIGHT_M  (LCDCAM_LCD_VA_HEIGHT_V << LCDCAM_LCD_VA_HEIGHT_S)
#define LCDCAM_LCD_VA_HEIGHT_V  0x000003FFU
#define LCDCAM_LCD_VA_HEIGHT_S  11
/** LCDCAM_LCD_VT_HEIGHT : R/W; bitpos: [30:21]; default: 0;
 *  It is the vertical total height of a frame.
 */
#define LCDCAM_LCD_VT_HEIGHT    0x000003FFU
#define LCDCAM_LCD_VT_HEIGHT_M  (LCDCAM_LCD_VT_HEIGHT_V << LCDCAM_LCD_VT_HEIGHT_S)
#define LCDCAM_LCD_VT_HEIGHT_V  0x000003FFU
#define LCDCAM_LCD_VT_HEIGHT_S  21
/** LCDCAM_LCD_RGB_MODE_EN : R/W; bitpos: [31]; default: 0;
 *  1: Enable LCD RGB mode. 0: Disable LCD RGB mode.
 */
#define LCDCAM_LCD_RGB_MODE_EN    (BIT(31))
#define LCDCAM_LCD_RGB_MODE_EN_M  (LCDCAM_LCD_RGB_MODE_EN_V << LCDCAM_LCD_RGB_MODE_EN_S)
#define LCDCAM_LCD_RGB_MODE_EN_V  0x00000001U
#define LCDCAM_LCD_RGB_MODE_EN_S  31

/** LCDCAM_LCD_CTRL1_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_CTRL1_REG (DR_REG_LCDCAM_BASE + 0x20)
/** LCDCAM_LCD_VB_FRONT : R/W; bitpos: [7:0]; default: 0;
 *  It is the vertical blank front porch of a frame.
 */
#define LCDCAM_LCD_VB_FRONT    0x000000FFU
#define LCDCAM_LCD_VB_FRONT_M  (LCDCAM_LCD_VB_FRONT_V << LCDCAM_LCD_VB_FRONT_S)
#define LCDCAM_LCD_VB_FRONT_V  0x000000FFU
#define LCDCAM_LCD_VB_FRONT_S  0
/** LCDCAM_LCD_HA_WIDTH : R/W; bitpos: [19:8]; default: 0;
 *  It is the horizontal active width of a frame.
 */
#define LCDCAM_LCD_HA_WIDTH    0x00000FFFU
#define LCDCAM_LCD_HA_WIDTH_M  (LCDCAM_LCD_HA_WIDTH_V << LCDCAM_LCD_HA_WIDTH_S)
#define LCDCAM_LCD_HA_WIDTH_V  0x00000FFFU
#define LCDCAM_LCD_HA_WIDTH_S  8
/** LCDCAM_LCD_HT_WIDTH : R/W; bitpos: [31:20]; default: 0;
 *  It is the horizontal total width of a frame.
 */
#define LCDCAM_LCD_HT_WIDTH    0x00000FFFU
#define LCDCAM_LCD_HT_WIDTH_M  (LCDCAM_LCD_HT_WIDTH_V << LCDCAM_LCD_HT_WIDTH_S)
#define LCDCAM_LCD_HT_WIDTH_V  0x00000FFFU
#define LCDCAM_LCD_HT_WIDTH_S  20

/** LCDCAM_LCD_CTRL2_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_CTRL2_REG (DR_REG_LCDCAM_BASE + 0x24)
/** LCDCAM_LCD_VSYNC_WIDTH : R/W; bitpos: [6:0]; default: 1;
 *  It is the position of LCD_VSYNC active pulse in a line.
 */
#define LCDCAM_LCD_VSYNC_WIDTH    0x0000007FU
#define LCDCAM_LCD_VSYNC_WIDTH_M  (LCDCAM_LCD_VSYNC_WIDTH_V << LCDCAM_LCD_VSYNC_WIDTH_S)
#define LCDCAM_LCD_VSYNC_WIDTH_V  0x0000007FU
#define LCDCAM_LCD_VSYNC_WIDTH_S  0
/** LCDCAM_LCD_VSYNC_IDLE_POL : R/W; bitpos: [7]; default: 0;
 *  It is the idle value of LCD_VSYNC.
 */
#define LCDCAM_LCD_VSYNC_IDLE_POL    (BIT(7))
#define LCDCAM_LCD_VSYNC_IDLE_POL_M  (LCDCAM_LCD_VSYNC_IDLE_POL_V << LCDCAM_LCD_VSYNC_IDLE_POL_S)
#define LCDCAM_LCD_VSYNC_IDLE_POL_V  0x00000001U
#define LCDCAM_LCD_VSYNC_IDLE_POL_S  7
/** LCDCAM_LCD_DE_IDLE_POL : R/W; bitpos: [8]; default: 0;
 *  It is the idle value of LCD_DE.
 */
#define LCDCAM_LCD_DE_IDLE_POL    (BIT(8))
#define LCDCAM_LCD_DE_IDLE_POL_M  (LCDCAM_LCD_DE_IDLE_POL_V << LCDCAM_LCD_DE_IDLE_POL_S)
#define LCDCAM_LCD_DE_IDLE_POL_V  0x00000001U
#define LCDCAM_LCD_DE_IDLE_POL_S  8
/** LCDCAM_LCD_HS_BLANK_EN : R/W; bitpos: [9]; default: 0;
 *  1: The pulse of LCD_HSYNC is out in vertical blanking lines RGB mode. 0: LCD_HSYNC
 *  pulse is valid only in active region lines in RGB mode.
 */
#define LCDCAM_LCD_HS_BLANK_EN    (BIT(9))
#define LCDCAM_LCD_HS_BLANK_EN_M  (LCDCAM_LCD_HS_BLANK_EN_V << LCDCAM_LCD_HS_BLANK_EN_S)
#define LCDCAM_LCD_HS_BLANK_EN_V  0x00000001U
#define LCDCAM_LCD_HS_BLANK_EN_S  9
/** LCDCAM_LCD_HSYNC_WIDTH : R/W; bitpos: [22:16]; default: 1;
 *  It is the position of LCD_HSYNC active pulse in a line.
 */
#define LCDCAM_LCD_HSYNC_WIDTH    0x0000007FU
#define LCDCAM_LCD_HSYNC_WIDTH_M  (LCDCAM_LCD_HSYNC_WIDTH_V << LCDCAM_LCD_HSYNC_WIDTH_S)
#define LCDCAM_LCD_HSYNC_WIDTH_V  0x0000007FU
#define LCDCAM_LCD_HSYNC_WIDTH_S  16
/** LCDCAM_LCD_HSYNC_IDLE_POL : R/W; bitpos: [23]; default: 0;
 *  It is the idle value of LCD_HSYNC.
 */
#define LCDCAM_LCD_HSYNC_IDLE_POL    (BIT(23))
#define LCDCAM_LCD_HSYNC_IDLE_POL_M  (LCDCAM_LCD_HSYNC_IDLE_POL_V << LCDCAM_LCD_HSYNC_IDLE_POL_S)
#define LCDCAM_LCD_HSYNC_IDLE_POL_V  0x00000001U
#define LCDCAM_LCD_HSYNC_IDLE_POL_S  23
/** LCDCAM_LCD_HSYNC_POSITION : R/W; bitpos: [31:24]; default: 0;
 *  It is the position of LCD_HSYNC active pulse in a line.
 */
#define LCDCAM_LCD_HSYNC_POSITION    0x000000FFU
#define LCDCAM_LCD_HSYNC_POSITION_M  (LCDCAM_LCD_HSYNC_POSITION_V << LCDCAM_LCD_HSYNC_POSITION_S)
#define LCDCAM_LCD_HSYNC_POSITION_V  0x000000FFU
#define LCDCAM_LCD_HSYNC_POSITION_S  24

/** LCDCAM_LCD_FIRST_CMD_VAL_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_FIRST_CMD_VAL_REG (DR_REG_LCDCAM_BASE + 0x28)
/** LCDCAM_LCD_FIRST_CMD_VALUE : R/W; bitpos: [31:0]; default: 0;
 *  The LCD write command value of first cmd cycle.
 */
#define LCDCAM_LCD_FIRST_CMD_VALUE    0xFFFFFFFFU
#define LCDCAM_LCD_FIRST_CMD_VALUE_M  (LCDCAM_LCD_FIRST_CMD_VALUE_V << LCDCAM_LCD_FIRST_CMD_VALUE_S)
#define LCDCAM_LCD_FIRST_CMD_VALUE_V  0xFFFFFFFFU
#define LCDCAM_LCD_FIRST_CMD_VALUE_S  0

/** LCDCAM_LCD_LATTER_CMD_VAL_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_LATTER_CMD_VAL_REG (DR_REG_LCDCAM_BASE + 0x2c)
/** LCDCAM_LCD_LATTER_CMD_VALUE : R/W; bitpos: [31:0]; default: 0;
 *  The LCD write command value of latter cmd cycle.
 */
#define LCDCAM_LCD_LATTER_CMD_VALUE    0xFFFFFFFFU
#define LCDCAM_LCD_LATTER_CMD_VALUE_M  (LCDCAM_LCD_LATTER_CMD_VALUE_V << LCDCAM_LCD_LATTER_CMD_VALUE_S)
#define LCDCAM_LCD_LATTER_CMD_VALUE_V  0xFFFFFFFFU
#define LCDCAM_LCD_LATTER_CMD_VALUE_S  0

/** LCDCAM_LCD_DLY_MODE_CFG1_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_DLY_MODE_CFG1_REG (DR_REG_LCDCAM_BASE + 0x30)
/** LCDCAM_DOUT16_MODE : R/W; bitpos: [1:0]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT16_MODE    0x00000003U
#define LCDCAM_DOUT16_MODE_M  (LCDCAM_DOUT16_MODE_V << LCDCAM_DOUT16_MODE_S)
#define LCDCAM_DOUT16_MODE_V  0x00000003U
#define LCDCAM_DOUT16_MODE_S  0
/** LCDCAM_DOUT17_MODE : R/W; bitpos: [3:2]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT17_MODE    0x00000003U
#define LCDCAM_DOUT17_MODE_M  (LCDCAM_DOUT17_MODE_V << LCDCAM_DOUT17_MODE_S)
#define LCDCAM_DOUT17_MODE_V  0x00000003U
#define LCDCAM_DOUT17_MODE_S  2
/** LCDCAM_DOUT18_MODE : R/W; bitpos: [5:4]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT18_MODE    0x00000003U
#define LCDCAM_DOUT18_MODE_M  (LCDCAM_DOUT18_MODE_V << LCDCAM_DOUT18_MODE_S)
#define LCDCAM_DOUT18_MODE_V  0x00000003U
#define LCDCAM_DOUT18_MODE_S  4
/** LCDCAM_DOUT19_MODE : R/W; bitpos: [7:6]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT19_MODE    0x00000003U
#define LCDCAM_DOUT19_MODE_M  (LCDCAM_DOUT19_MODE_V << LCDCAM_DOUT19_MODE_S)
#define LCDCAM_DOUT19_MODE_V  0x00000003U
#define LCDCAM_DOUT19_MODE_S  6
/** LCDCAM_DOUT20_MODE : R/W; bitpos: [9:8]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT20_MODE    0x00000003U
#define LCDCAM_DOUT20_MODE_M  (LCDCAM_DOUT20_MODE_V << LCDCAM_DOUT20_MODE_S)
#define LCDCAM_DOUT20_MODE_V  0x00000003U
#define LCDCAM_DOUT20_MODE_S  8
/** LCDCAM_DOUT21_MODE : R/W; bitpos: [11:10]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT21_MODE    0x00000003U
#define LCDCAM_DOUT21_MODE_M  (LCDCAM_DOUT21_MODE_V << LCDCAM_DOUT21_MODE_S)
#define LCDCAM_DOUT21_MODE_V  0x00000003U
#define LCDCAM_DOUT21_MODE_S  10
/** LCDCAM_DOUT22_MODE : R/W; bitpos: [13:12]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT22_MODE    0x00000003U
#define LCDCAM_DOUT22_MODE_M  (LCDCAM_DOUT22_MODE_V << LCDCAM_DOUT22_MODE_S)
#define LCDCAM_DOUT22_MODE_V  0x00000003U
#define LCDCAM_DOUT22_MODE_S  12
/** LCDCAM_DOUT23_MODE : R/W; bitpos: [15:14]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT23_MODE    0x00000003U
#define LCDCAM_DOUT23_MODE_M  (LCDCAM_DOUT23_MODE_V << LCDCAM_DOUT23_MODE_S)
#define LCDCAM_DOUT23_MODE_V  0x00000003U
#define LCDCAM_DOUT23_MODE_S  14
/** LCDCAM_LCD_CD_MODE : R/W; bitpos: [17:16]; default: 0;
 *  The output LCD_CD is delayed by module clock LCD_CLK. 0: output without delayed. 1:
 *  delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
 */
#define LCDCAM_LCD_CD_MODE    0x00000003U
#define LCDCAM_LCD_CD_MODE_M  (LCDCAM_LCD_CD_MODE_V << LCDCAM_LCD_CD_MODE_S)
#define LCDCAM_LCD_CD_MODE_V  0x00000003U
#define LCDCAM_LCD_CD_MODE_S  16
/** LCDCAM_LCD_DE_MODE : R/W; bitpos: [19:18]; default: 0;
 *  The output LCD_DE is delayed by module clock LCD_CLK. 0: output without delayed. 1:
 *  delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
 */
#define LCDCAM_LCD_DE_MODE    0x00000003U
#define LCDCAM_LCD_DE_MODE_M  (LCDCAM_LCD_DE_MODE_V << LCDCAM_LCD_DE_MODE_S)
#define LCDCAM_LCD_DE_MODE_V  0x00000003U
#define LCDCAM_LCD_DE_MODE_S  18
/** LCDCAM_LCD_HSYNC_MODE : R/W; bitpos: [21:20]; default: 0;
 *  The output LCD_HSYNC is delayed by module clock LCD_CLK. 0: output without delayed.
 *  1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
 */
#define LCDCAM_LCD_HSYNC_MODE    0x00000003U
#define LCDCAM_LCD_HSYNC_MODE_M  (LCDCAM_LCD_HSYNC_MODE_V << LCDCAM_LCD_HSYNC_MODE_S)
#define LCDCAM_LCD_HSYNC_MODE_V  0x00000003U
#define LCDCAM_LCD_HSYNC_MODE_S  20
/** LCDCAM_LCD_VSYNC_MODE : R/W; bitpos: [23:22]; default: 0;
 *  The output LCD_VSYNC is delayed by module clock LCD_CLK. 0: output without delayed.
 *  1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
 */
#define LCDCAM_LCD_VSYNC_MODE    0x00000003U
#define LCDCAM_LCD_VSYNC_MODE_M  (LCDCAM_LCD_VSYNC_MODE_V << LCDCAM_LCD_VSYNC_MODE_S)
#define LCDCAM_LCD_VSYNC_MODE_V  0x00000003U
#define LCDCAM_LCD_VSYNC_MODE_S  22

/** LCDCAM_LCD_DLY_MODE_CFG2_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_DLY_MODE_CFG2_REG (DR_REG_LCDCAM_BASE + 0x38)
/** LCDCAM_DOUT0_MODE : R/W; bitpos: [1:0]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT0_MODE    0x00000003U
#define LCDCAM_DOUT0_MODE_M  (LCDCAM_DOUT0_MODE_V << LCDCAM_DOUT0_MODE_S)
#define LCDCAM_DOUT0_MODE_V  0x00000003U
#define LCDCAM_DOUT0_MODE_S  0
/** LCDCAM_DOUT1_MODE : R/W; bitpos: [3:2]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT1_MODE    0x00000003U
#define LCDCAM_DOUT1_MODE_M  (LCDCAM_DOUT1_MODE_V << LCDCAM_DOUT1_MODE_S)
#define LCDCAM_DOUT1_MODE_V  0x00000003U
#define LCDCAM_DOUT1_MODE_S  2
/** LCDCAM_DOUT2_MODE : R/W; bitpos: [5:4]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT2_MODE    0x00000003U
#define LCDCAM_DOUT2_MODE_M  (LCDCAM_DOUT2_MODE_V << LCDCAM_DOUT2_MODE_S)
#define LCDCAM_DOUT2_MODE_V  0x00000003U
#define LCDCAM_DOUT2_MODE_S  4
/** LCDCAM_DOUT3_MODE : R/W; bitpos: [7:6]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT3_MODE    0x00000003U
#define LCDCAM_DOUT3_MODE_M  (LCDCAM_DOUT3_MODE_V << LCDCAM_DOUT3_MODE_S)
#define LCDCAM_DOUT3_MODE_V  0x00000003U
#define LCDCAM_DOUT3_MODE_S  6
/** LCDCAM_DOUT4_MODE : R/W; bitpos: [9:8]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT4_MODE    0x00000003U
#define LCDCAM_DOUT4_MODE_M  (LCDCAM_DOUT4_MODE_V << LCDCAM_DOUT4_MODE_S)
#define LCDCAM_DOUT4_MODE_V  0x00000003U
#define LCDCAM_DOUT4_MODE_S  8
/** LCDCAM_DOUT5_MODE : R/W; bitpos: [11:10]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT5_MODE    0x00000003U
#define LCDCAM_DOUT5_MODE_M  (LCDCAM_DOUT5_MODE_V << LCDCAM_DOUT5_MODE_S)
#define LCDCAM_DOUT5_MODE_V  0x00000003U
#define LCDCAM_DOUT5_MODE_S  10
/** LCDCAM_DOUT6_MODE : R/W; bitpos: [13:12]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT6_MODE    0x00000003U
#define LCDCAM_DOUT6_MODE_M  (LCDCAM_DOUT6_MODE_V << LCDCAM_DOUT6_MODE_S)
#define LCDCAM_DOUT6_MODE_V  0x00000003U
#define LCDCAM_DOUT6_MODE_S  12
/** LCDCAM_DOUT7_MODE : R/W; bitpos: [15:14]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT7_MODE    0x00000003U
#define LCDCAM_DOUT7_MODE_M  (LCDCAM_DOUT7_MODE_V << LCDCAM_DOUT7_MODE_S)
#define LCDCAM_DOUT7_MODE_V  0x00000003U
#define LCDCAM_DOUT7_MODE_S  14
/** LCDCAM_DOUT8_MODE : R/W; bitpos: [17:16]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT8_MODE    0x00000003U
#define LCDCAM_DOUT8_MODE_M  (LCDCAM_DOUT8_MODE_V << LCDCAM_DOUT8_MODE_S)
#define LCDCAM_DOUT8_MODE_V  0x00000003U
#define LCDCAM_DOUT8_MODE_S  16
/** LCDCAM_DOUT9_MODE : R/W; bitpos: [19:18]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT9_MODE    0x00000003U
#define LCDCAM_DOUT9_MODE_M  (LCDCAM_DOUT9_MODE_V << LCDCAM_DOUT9_MODE_S)
#define LCDCAM_DOUT9_MODE_V  0x00000003U
#define LCDCAM_DOUT9_MODE_S  18
/** LCDCAM_DOUT10_MODE : R/W; bitpos: [21:20]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT10_MODE    0x00000003U
#define LCDCAM_DOUT10_MODE_M  (LCDCAM_DOUT10_MODE_V << LCDCAM_DOUT10_MODE_S)
#define LCDCAM_DOUT10_MODE_V  0x00000003U
#define LCDCAM_DOUT10_MODE_S  20
/** LCDCAM_DOUT11_MODE : R/W; bitpos: [23:22]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT11_MODE    0x00000003U
#define LCDCAM_DOUT11_MODE_M  (LCDCAM_DOUT11_MODE_V << LCDCAM_DOUT11_MODE_S)
#define LCDCAM_DOUT11_MODE_V  0x00000003U
#define LCDCAM_DOUT11_MODE_S  22
/** LCDCAM_DOUT12_MODE : R/W; bitpos: [25:24]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT12_MODE    0x00000003U
#define LCDCAM_DOUT12_MODE_M  (LCDCAM_DOUT12_MODE_V << LCDCAM_DOUT12_MODE_S)
#define LCDCAM_DOUT12_MODE_V  0x00000003U
#define LCDCAM_DOUT12_MODE_S  24
/** LCDCAM_DOUT13_MODE : R/W; bitpos: [27:26]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT13_MODE    0x00000003U
#define LCDCAM_DOUT13_MODE_M  (LCDCAM_DOUT13_MODE_V << LCDCAM_DOUT13_MODE_S)
#define LCDCAM_DOUT13_MODE_V  0x00000003U
#define LCDCAM_DOUT13_MODE_S  26
/** LCDCAM_DOUT14_MODE : R/W; bitpos: [29:28]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT14_MODE    0x00000003U
#define LCDCAM_DOUT14_MODE_M  (LCDCAM_DOUT14_MODE_V << LCDCAM_DOUT14_MODE_S)
#define LCDCAM_DOUT14_MODE_V  0x00000003U
#define LCDCAM_DOUT14_MODE_S  28
/** LCDCAM_DOUT15_MODE : R/W; bitpos: [31:30]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT15_MODE    0x00000003U
#define LCDCAM_DOUT15_MODE_M  (LCDCAM_DOUT15_MODE_V << LCDCAM_DOUT15_MODE_S)
#define LCDCAM_DOUT15_MODE_V  0x00000003U
#define LCDCAM_DOUT15_MODE_S  30

/** LCDCAM_LC_DMA_INT_ENA_REG register
 *  LCDCAM interrupt enable register.
 */
#define LCDCAM_LC_DMA_INT_ENA_REG (DR_REG_LCDCAM_BASE + 0x64)
/** LCDCAM_LCD_VSYNC_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The enable bit for LCD frame end interrupt.
 */
#define LCDCAM_LCD_VSYNC_INT_ENA    (BIT(0))
#define LCDCAM_LCD_VSYNC_INT_ENA_M  (LCDCAM_LCD_VSYNC_INT_ENA_V << LCDCAM_LCD_VSYNC_INT_ENA_S)
#define LCDCAM_LCD_VSYNC_INT_ENA_V  0x00000001U
#define LCDCAM_LCD_VSYNC_INT_ENA_S  0
/** LCDCAM_LCD_TRANS_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The enable bit for lcd transfer end interrupt.
 */
#define LCDCAM_LCD_TRANS_DONE_INT_ENA    (BIT(1))
#define LCDCAM_LCD_TRANS_DONE_INT_ENA_M  (LCDCAM_LCD_TRANS_DONE_INT_ENA_V << LCDCAM_LCD_TRANS_DONE_INT_ENA_S)
#define LCDCAM_LCD_TRANS_DONE_INT_ENA_V  0x00000001U
#define LCDCAM_LCD_TRANS_DONE_INT_ENA_S  1
/** LCDCAM_CAM_VSYNC_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The enable bit for Camera frame end interrupt.
 */
#define LCDCAM_CAM_VSYNC_INT_ENA    (BIT(2))
#define LCDCAM_CAM_VSYNC_INT_ENA_M  (LCDCAM_CAM_VSYNC_INT_ENA_V << LCDCAM_CAM_VSYNC_INT_ENA_S)
#define LCDCAM_CAM_VSYNC_INT_ENA_V  0x00000001U
#define LCDCAM_CAM_VSYNC_INT_ENA_S  2
/** LCDCAM_CAM_HS_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The enable bit for Camera line interrupt.
 */
#define LCDCAM_CAM_HS_INT_ENA    (BIT(3))
#define LCDCAM_CAM_HS_INT_ENA_M  (LCDCAM_CAM_HS_INT_ENA_V << LCDCAM_CAM_HS_INT_ENA_S)
#define LCDCAM_CAM_HS_INT_ENA_V  0x00000001U
#define LCDCAM_CAM_HS_INT_ENA_S  3
/** LCDCAM_LCD_UNDERRUN_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The enable bit for LCD underrun interrupt
 */
#define LCDCAM_LCD_UNDERRUN_INT_ENA    (BIT(4))
#define LCDCAM_LCD_UNDERRUN_INT_ENA_M  (LCDCAM_LCD_UNDERRUN_INT_ENA_V << LCDCAM_LCD_UNDERRUN_INT_ENA_S)
#define LCDCAM_LCD_UNDERRUN_INT_ENA_V  0x00000001U
#define LCDCAM_LCD_UNDERRUN_INT_ENA_S  4

/** LCDCAM_LC_DMA_INT_RAW_REG register
 *  LCDCAM interrupt raw register, valid in level.
 */
#define LCDCAM_LC_DMA_INT_RAW_REG (DR_REG_LCDCAM_BASE + 0x68)
/** LCDCAM_LCD_VSYNC_INT_RAW : RO/WTC/SS; bitpos: [0]; default: 0;
 *  The raw bit for LCD frame end interrupt.
 */
#define LCDCAM_LCD_VSYNC_INT_RAW    (BIT(0))
#define LCDCAM_LCD_VSYNC_INT_RAW_M  (LCDCAM_LCD_VSYNC_INT_RAW_V << LCDCAM_LCD_VSYNC_INT_RAW_S)
#define LCDCAM_LCD_VSYNC_INT_RAW_V  0x00000001U
#define LCDCAM_LCD_VSYNC_INT_RAW_S  0
/** LCDCAM_LCD_TRANS_DONE_INT_RAW : RO/WTC/SS; bitpos: [1]; default: 0;
 *  The raw bit for lcd transfer end interrupt.
 */
#define LCDCAM_LCD_TRANS_DONE_INT_RAW    (BIT(1))
#define LCDCAM_LCD_TRANS_DONE_INT_RAW_M  (LCDCAM_LCD_TRANS_DONE_INT_RAW_V << LCDCAM_LCD_TRANS_DONE_INT_RAW_S)
#define LCDCAM_LCD_TRANS_DONE_INT_RAW_V  0x00000001U
#define LCDCAM_LCD_TRANS_DONE_INT_RAW_S  1
/** LCDCAM_CAM_VSYNC_INT_RAW : RO/WTC/SS; bitpos: [2]; default: 0;
 *  The raw bit for Camera frame end interrupt.
 */
#define LCDCAM_CAM_VSYNC_INT_RAW    (BIT(2))
#define LCDCAM_CAM_VSYNC_INT_RAW_M  (LCDCAM_CAM_VSYNC_INT_RAW_V << LCDCAM_CAM_VSYNC_INT_RAW_S)
#define LCDCAM_CAM_VSYNC_INT_RAW_V  0x00000001U
#define LCDCAM_CAM_VSYNC_INT_RAW_S  2
/** LCDCAM_CAM_HS_INT_RAW : RO/WTC/SS; bitpos: [3]; default: 0;
 *  The raw bit for Camera line interrupt.
 */
#define LCDCAM_CAM_HS_INT_RAW    (BIT(3))
#define LCDCAM_CAM_HS_INT_RAW_M  (LCDCAM_CAM_HS_INT_RAW_V << LCDCAM_CAM_HS_INT_RAW_S)
#define LCDCAM_CAM_HS_INT_RAW_V  0x00000001U
#define LCDCAM_CAM_HS_INT_RAW_S  3
/** LCDCAM_LCD_UNDERRUN_INT_RAW : RO/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit for LCD underrun interrupt
 */
#define LCDCAM_LCD_UNDERRUN_INT_RAW    (BIT(4))
#define LCDCAM_LCD_UNDERRUN_INT_RAW_M  (LCDCAM_LCD_UNDERRUN_INT_RAW_V << LCDCAM_LCD_UNDERRUN_INT_RAW_S)
#define LCDCAM_LCD_UNDERRUN_INT_RAW_V  0x00000001U
#define LCDCAM_LCD_UNDERRUN_INT_RAW_S  4

